#include <iostream>
using namespace std;

int main() {
    cout << "*************************************\n";
    cout << "*      Seminar 3.04. Task №02       *\n";
    cout << "*************************************\n\n";
    
    int a[10], b[10], c[10], na, nb, nc = 0, i, j, k;

    // Ввод массива A
    cout << "Введите длину массива A: ";
    cin >> na;
    cout << "Введите " << na << " элементов:\n";
    for (i = 0; i < na; i++) {
        cout << "A[" << i << "] = ";
        cin >> a[i];
    }

    // Ввод массива B
    cout << "Введите длину массива B: ";
    cin >> nb;
    cout << "Введите " << nb << " элементов:\n";
    for (i = 0; i < nb; i++) {
        cout << "B[" << i << "] = ";
        cin >> b[i];
    }

    // Формирование массива C
    for (i = 0; i < na; i++) {
        // Проверка повторения a[i] в b несколько раз
        // k - число повторов a[i] в b

        for (j = 0, k = 0; j < nb && k < 2; j++) {
            if (a[i] == b[j]) {
                k++;
            }
        }
        if (k == 2) { // Условие повторения
            for (j = 0; j < nc && a[i] != c[j]; j++);
            if (j == nc) { // Условие отсутствия в C
                c[nc++] = a[i];
            }
        }
    }

    // Вывод результата
    if (!nc) {
        cout << "Нет массива C\n";
    } else {
        cout << "Массив С из " << nc << " элементов\n";
        for (j = 0; j < nc; j++) {
            cout << " " << c[j];
        }
        cout << endl;
    }

    return 0;
}
