#include <iostream> // Потоковый ввод и вывод

using namespace std;

// Используем прототип функции перестановки
bool sort(int n, int A[]);
  
int main() {
  cout << "*************************************\n";
  cout << "*      Seminar 3.05. Task №01       *\n";
  cout << "*************************************\n\n";
  int A[50], n, i;
  cout << "Введите 0 < n <= 50: ";
  cin >> n;
  cout << "Введите элементы массива\n";
  for (i = 0; i < n; i++) 
    cin >> *(A + i);
  
  if (sort(n, A)) { // Вызов функции сортировки
    cout << "Преобразованный массив:\n";
    for (i = 0; i < n; i++) 
      cout << "  " << *(A + i);
    cout << " \n";
  } else {
    cout << "Без изменений\n";
  }
  // Признак успешного завершения программы
  return 0;
}

// Функция сортировки
bool sort(int n, int A[]) {
  // Описание переменных
  int b, *i, nc = -1, *j;
  for (i = A; i < A + n; i++) {
    if (*i >= 0) {
      if (nc != -1) {
        // Сдвиг вправо, начиная с последнего 
        for (b = *i, j = i; j >= A + nc + 1; j--)
          *j = *(j - 1);
        *(A + nc++) = b;
      }
    } else if (nc == -1) {
      nc = i - A;
    }
  }
  return nc != -1;
}